{
   "name":"Adriano Caversan",
   "title":"Graphic Computing and Multimedia Software Development",
   "pdf":"docs/adriano-caversan-frontend-en.pdf",
   "profile":{
      "occupation":{
         "title":"Occupation",
         "description":"Designer and Developer for Web, IoT, Games, Digital Signage and Multimedia."
      },
      "birth":{
         "title":"Birth",
         "description":"July 02, 1976"
      },
      "phone":{
         "title":"Fone/Whatsapp",
         "description":"+55 11 98091-0161"
      },
      "github":{
         "title":"GitHub",
         "description":"https://github.com/caversan"
      },
      "linkedin":{
         "title":"LinkedIn",
         "description":"https://www.linkedin.com/in/adriano-caversan/"
      },
      "email":{
         "title":"E-mail",
         "description":"adriano.caversan@gmail.com"
      },
      "address":{
         "title":"Location",
         "description":"São Paulo, Brazil"
      },
      "nationality":{
         "title":"Nationality",
         "description":"Brazilian"
      },
      "matrialstatus":{
         "title":"Matrial status",
         "description":"Common-law marriage"
      },
      "children":{
         "title":"Children",
         "description":"Yes"
      },
      "driverlicense":{
         "title":"Driver License",
         "description":"cat. B valid only in Brazil"
      },
      "car":{
         "title":"Particular car",
         "description":"Yes"
      },
      "travel":{
         "title":"Business travel availability",
         "description":"Yes for short travels"
      },
      "move":{
         "title":"Availability for moving",
         "description":" Yes with my wife and my daughter"
      }
   },
   "sections":{
      "opportunity":{
         "title":"Desired Opportunity",
         "description":"Work with design and development for web, desktop, IoT, audiovisual, games and multimedia."
      },
      "profile":{
         "title":"Summary",
         "description":"With over 25 years of experience, I’m a multidisciplinary IT and Design professional with a generalist profile, having worked across web development studios, game studios, audiovisual and multimedia productions, advertising agencies, digital signage, digital out-of-home (DOOH), and online retail. I have deep expertise in software development processes, with a strong focus on Frontend development for web, games, and multimedia. I also work as a Designer, specializing in interfaces, UX/UI, and 2D animation. This rare blend of IT and Design allows me to deliver visually faithful projects with high-quality code, an intersection that few professionals explore. My integrated knowledge also supports the creation of scripts for games and animations, enhancing visual fluidity and significantly accelerating delivery timelines. Another key differentiator in my career has been acting as a bridge between Design and IT teams, developing technical specifications for design files, automating delivery workflows, and generating code directly for development teams. This integration has substantially increased output, reduced errors, and brought predictability, quality, and consistency to the entire production process."
      },
      "skills":{
         "title":"<b>Skills</b>",
         "grid":[
            "<b>Software Development:</b> HTML5, Javascript, Typescript, CSS3, Python, PHP, C, C++, C#, .NET Framework, PHP, MQTT, AMQP, RabbitMQ, Kafka, Clean Code, SOLID, DRY, KISS, Algorithms, Paradigms, Powershell, Shell, Batch, Adobe Extended Script, Git, SVN, Wordpress, Drupal, Git Copilot, AI. Intermediate Knowledge: React, Redux, Vue, Angular, Electron, Microservices, Microfrontend, NodeJS, Node-RED, Docker, Kubernetes, API REST, SOAP, gRCP, GraphQL, Design Patterns, GoF, NoSQL and SQL Databases, LGPD, data analysis, AI algorithms (Machine Learning, Deep Learning, image visualization, genetic algorithms and neural networks). Basic Knowledge: DevOps e CI/CD, Github Actions, automatic tests (TDD). Cloud (AWS, Lambda, GCP and OCI), (IaaS, PaaS, SaaS), Docker and Kubernetes, Infrastructure as a Code (IaC), cybersecurity, cryptography, JWT, Auth0, Observability and Monitoring (Datadog, Grafana), Clean Architecture.<br/><br/>",
            "<b>Design and Web Marketing:</b> Photoshop, Krita, GIMP, Corel Draw, Illustrator, Inkscape, InDesign, XD, Figma, UX/UI, accessibility, web, Bridge, Google Analytics, ad-banners, programmatic media, social media, DCO, landing pages, SEO metrics, web funnel, consumer journey, retail media.<br/><br/>",
            "<b>Project Metodologies:</b> DDD, Event Storming, Brainstorming, Design Thinking, Kanban, Agile, SCRUM, Jira, Trello, Slack, Project, PMI, Waterfall, Six Sigma, Lean, Toyota.<br/><br/>",
            "<b>Eletronics and Computer Engineering:</b> IoT, Industry 4.0, Smart Cities, Mechatronics, Motors, Generators, Batteries, Strength and Mechanics of Materials, Optics, Quantum Physics, Electromagnetism, Technological Chemistry, Welding, Microchips, Electronic Components, IO Communication Ports, Communication Protocols, Signal Analysis, Firmware, PLC (Arduino, STM32 and ESP32), Sensors, Actuators, Metrology.<br/><br/>",
            "<b>Animation, Games and Audiovisual Production:</b> After Effects, DaVinci Resolve, Motionscript, GSAP, Google Web Designer (GWD), Adobe Animate, Milagro, Actionscript, 2D and 3D games, characters and environments, Unity, Godot, Pygame, Technical Art, Level Design, GDD, 3D Modeling, Textures, Special Effects, Blender, Spine, Première, Media Encoder, OBS, Audition, Sound Forge, Audacity, Kdenlive, audiovisual studio, cameras, lighting, cabling, linear and non-linear editing consoles, switchers, splitters, video encoders, protocols and codecs for streaming on demand, broadcast and live transmission, satellite transmission, software development for media players for web, STB, IPTV, and satellite receivers."
         ]
      },
      "languages":{
         "title":"Languages",
         "grid":[
            "English (Advanced) B1 - TOEFL(2015) score 450",
            "Spanish (Technical Reading)",
            "Portuguese (Native)"
         ]
      },
      "graduation":{
         "title":"Education",
         "grid":[
            {
               "title":"MBA - Software Engineering",
               "description":"USP/Esalq - started Feb/2024 - expected graduation in Jan/2026"
            },
            {
               "title":"Bachelor Computer Engineering",
               "description":"Univesp - started Aug/2021 - expected graduation in Jan/2026"
            },
            {
               "title":"Bachelor in Information Technology (IoT)",
               "description":"Univesp - started Aug/2021 - graduated in Aug/2024"
            },
            {
               "title":"Technologist in Systems Analysis (Emphasis on Digital Games)",
               "description":"FATEC - started Aug/2011 - graduated in Jul/2015"
            },
            {
               "title":"Bachelor in Advertising and Propaganda",
               "description":"FIZO - started Feb/2009 - course interrupted in the 3rd semester."
            },
            {
               "title":"Technologist in Digital Graphic Creation and Production",
               "description":"Unip - started Aug/2006 - course interrupted in the 4th semester."
            },
            {
               "title":"Technologist in Multimedia Design",
               "description":"SENAC/SP - started Feb/2001 - course interrupted in the 4th semester."
            }
         ]
      },
      "courses":{
         "title":"Courses and Specializations",
         "grid":[
            [
               {
                  "title":"Paulista Discipline of Accessibility and Inclusion",
                  "description":"UNIVESP - 2025 (duration 80 hours)"
               },
               {
                  "title":"Neurosciences in Higher Education: Strategies for Healthy Academic Development",
                  "description":"USP - 2025 (duration 30 hours)"
               },
               {
                  "title":"Redux, React Redux & Redux Toolkit RTK Course",
                  "description":"Udemy - 2024 (duration 20 hours)"
               },
               {
                  "title":"Modern Web Development with HTML, CSS, Javascript, React, NodeJs and more",
                  "description":"Udemy - 2020 (duration 88 hours)"
               },
               {
                  "title":"AngularJS",
                  "description":"Loiane.training – 2020 (duration 28 hours)"
               },
               {
                  "title":"Arduino",
                  "description":"Centro Paula Souza - Cetec - 2022 (duration 30 hours)"
               },
               {
                  "title":"Digital Democracy",
                  "description":"FGV and nic.br - 2022 (duration 5 hours)"
               },
               {
                  "title":"Introduction to Javascript",
                  "description":"Bradesco Foundation - 2022 (duration 20 hours)"
               },
               {
                  "title":"Unveiling 5G",
                  "description":"Senai - 2022 (duration 15 hours)"
               },
               {
                  "title":"Unveiling Blockchain",
                  "description":"Senai - 2022 (duration 20 hours)"
               },
               {
                  "title":"HTML and CSS",
                  "description":"Bradesco Foundation - 2022 (duration 24 hours)"
               },
               {
                  "title":"Innovating with CSS",
                  "description":"Bradesco Foundation - 2022 (duration 26 hours)"
               },
               {
                  "title":"Introduction to Data Science",
                  "description":"FGV - 2022 (duration 60 hours)"
               },
               {
                  "title":"Data Protection",
                  "description":"FGV and nic.br - 2022 (duration 5 hours)"
               },
               {
                  "title":"Digital Security",
                  "description":"FGV and nic.br - 2022 (duration 5 hours)"
               },
               {
                  "title":"Drawing Workshop",
                  "description":"Osasco Art School - SP - 2006 (duration 60 hours)"
               },
               {
                  "title":"Filming and Direction",
                  "description":"Senac - SP - 2003 (duration 20 hours)"
               },
               {
                  "title":"Game Workshop",
                  "description":"Senac - SP - 2002 (duration 1 year)"
               },
               {
                  "title":"Lightwave 3D Modeling and Animation",
                  "description":"Senac - SP - 2002 (duration 60 hours)"
               },
               {
                  "title":"Web Design",
                  "description":"Senac - SP - 2000 (duration 96 hours)"
               },
               {
                  "title":"Graphic Arts and Illustration",
                  "description":"Bradesco Foundation - 1992 (duration 960 hours)"
               }
            ]
         ]
      },
      "experience":{
         "title":"Professional Experience",
         "grid":[
            {
               "title":"Eletromidia S/A - nov/2022 to mar/2025<br/>Position: Senior Frontend Developer",
               "description":"<b>Responsibilities: </b>Coordination and mentoring of interns and trainees; technical reference in frontend development for animation and rich media; gathering technical requirements for frontend and HTML5 animations; software development for digital signage using React, Redux, Electron, and NodeJS; conversion of legacy Flash Actionscript code to modern web technologies; animation using HTML5, CSS3, JavaScript, GSAP, Adobe Animate, Milagro, Google Web Designer; high-impact special projects for digital signage involving video walls, LED matrix, and professional audiovisual equipment; frontend integration with data APIs for dynamic consumption of text, image, and video; graphic material handling using Adobe Photoshop, Adobe After Effects, and Adobe Illustrator; advanced video rendering using FFMPEG and Adobe Media Encoder; media conversion automation using FFMPEG and Python scripts.",
               "link":"https://eletromidia.com.br/"
            },
            {
               "title":"Hogarth Worldwide - jun/2021 to oct/2022<br/>Position: Senior Frontend Developer",
               "description":"<b>Responsibilities: </b>Animation of dynamic and static advertising banners using HTML5, CSS3, and JavaScript animation frameworks such as GSAP, Adobe Animate, Milagro, Google Web Designer; graphic material handling using Adobe Bridge, Adobe Photoshop, Adobe After Effects, and Adobe Illustrator; variation of banner formats ensuring high throughput and graphic consistency; automation of image optimization processes for the web; delivery of a high volume of advertising banners across more than 150 projects and format variations for companies such as Bayer, L'Oréal, Coca-Cola, BMW, Amex, Jameson and more.",
               "link":"https://hogarth.com/"
            },
            {
               "title":"IGS International Solutions - sep/2015 to nov/2019<br/>Position: Senior Designer (Lead Technical Artists)",
               "description":"<b>Responsibilities: </b>Specialist in casino game projects using Adobe Extended Script, Adobe After Effects, Adobe Animate, Adobe Photoshop, Adobe Illustrator, Adobe Audition, C, C++, Godot, Spine; script development for automation and optimization of multimedia creation using Adobe Extended Script, JavaScript, Python, Batch Script, PowerShell, Shell, Visual Basic, FFMPEG, ImageMagick, and PNG Gauntlet; technological update and remastering of legacy games from the 80s and 90s based on legacy technologies such as MS-DOS, Windows XP, C and C++, as well as legacy formats for sound, video, and image; special effects for game cabinets using IoT controllers for real-time interaction with LED strips and sound effects; animation of characters and graphic elements of the game; leadership of the Tech Artists team, providing all creative content for the gaming platform.",
               "link":"https://ortizgaming.com/"
            },
            {
               "title":"Atmo Mídia Digital Corporativa - sep/2013 to sep/2015<br/>Position: Flash Programmer",
               "description":"<b>Responsibilities: </b>Analysis and development of systems for Digital Signage, kiosks, and multimedia; systems for video streaming on demand or live; transmission via web or satellite through the Digital TV system using FFMPEG, OBS, and Adobe Media Encoder; configuration and optimization of operating systems for Windows, Linux, and Android; high-impact special projects for digital signage involving video walls, LED matrix, and professional audiovisual equipment; hardware testing, requirements gathering, and preventive maintenance; programming for embedded systems and digital signage devices using Actionscript 3, .Net Framework, C#, and C++; use of serial ports for IO communication; firmware updates; frontend integration with data APIs for dynamic consumption of text, image, and video; graphic material handling using Adobe Photoshop, Adobe After Effects, and Adobe Illustrator; major national company cases such as Magalu, Habib’s, Cacau Show, Military Police of the State of São Paulo, KPMG, Casas Bahia, Ri Happy, Bodytech, DASA, Natura, Bayer.",
               "link":"https://atmodigital.com.br/"
            },
            {
               "title":"Unidas Rent a Car - jun/2013 to sep/2013<br/>Position: Digital Marketing Analyst",
               "description":"<b>Responsibilities: </b>Coordination of online media projects; construction and maintenance of corporate portals using HTML, CSS, JavaScript, WordPress, and Adobe Flash; integration with social media service APIs; creation of animations for banners and landing pages using Adobe Flash, Actionscript, and GIF; monitoring, metrics analysis, and SEO optimization; email marketing production; A/B testing.",
               "link":"https://unidas.com.br"
            },
            {
               "title":"Elemidia Empresas - aug/2007 to may/2013<br/>Position: Programmer",
               "description":"<b>Responsibilities: </b>Actionscript 2 programming for maintenance and development of new features for Digital Signage and Corporate TV software at Elemidia Empresas; layouts for Corporate TV interfaces based on client visual identity; 2D animations and stingers; video editing and processing using Adobe Flash, After Effects, and FFMPEG; frontend integration with data APIs for dynamic consumption of text, image, and video; graphic material handling using Adobe Photoshop, Adobe After Effects, and Adobe Illustrator; major national and multinational company cases with participation in over 300 projects including Nokia, Abril, Unilever, Volkswagen, Philips, Abbott, Syngenta and more.",
               "link":"https://eletromidia.com.br/"
            },
            {
               "title":"<i>Previous Experience - Between 2000 and 2007<br/>Companies: Graphic Companies; Digital Advertising Agencies and freelance projects as Web Designer; Multimedia Designer and Frontend Developer.</i>",
               "description":"<i><b>Responsibilities: </b>Project management, cost analysis for web and multimedia; journalistic photo and video coverage for fairs, social and corporate events; audiovisual equipment setup, lighting setup; hiring professionals and equipment for photography and audiovisual projects; direction of analog and digital photo and video studio; design, development, and maintenance of static and dynamic websites; backend creation for dynamic content and services such as forums, polls, chat rooms, contact forms, image galleries; integration with news APIs; hosting control and maintenance using CPanel and Linux; creation of animations for banners, landing pages, and corporate materials; 3D animation; image, audio, and video editing; email marketing production and delivery; monitoring, metrics analysis, and SEO optimization; A/B testing; user support.</i>",
               "link":""
            }
         ]
      },
      "portifolio":{
         "title":"Some works",
         "grid":[
            {
               "title":"AD BANNERS",
               "grid":[
                  {
                     "title":"between 2020 and 2022",
                     "description":"Web animation for dynamic or static Ad Banners using Adobe Tools, HTML5, CSS3 and Javascript animation frameworks like GSAP, Adobe Animate, Milagro and Google Web Designer.",
                     "thumb":"img/portifolio/thumbs/banners.png",
                     "content":"videos/banners.mp4"
                  }
               ]
            },
            {
               "title":"DIGITAL SIGNAGE",
               "grid":[
                  {
                     "title":"between 2007 and 2015",
                     "description":"Development of a Digital Signage Software for Atmo and Elemidia, virtual radio and corporate TV. Application programmed in .Net, Actionscript, Batch Script, Powershell and JavaScript fully parametrized for automate the software replication for many costumers and based in micro modules to permiting the software customization, watchdog (failure control) to bring stability in less resources hardware.",
                     "thumb":"img/portifolio/thumbs/digital_signage.png",
                     "content":"videos/digital_signage.m4v"
                  }
               ]
            },
            {
               "title":"WEB",
               "grid":[
                  {
                     "title":"2010 - Mantu",
                     "description":"Web-site for show bar.<br/>Resources: Site in PHP, XML and MySql with user control, restrict access to a photo gallery, Banner manager OpenX, Google Maps, Google Analytics, CSS3 and JQuery.",
                     "thumb":"img/portifolio/thumbs/mantu.png",
                     "content":"img/portifolio/mantu.png"
                  },
                  {
                     "title":"2010 - Porto Velho Bar",
                     "description":"Web-site for show bar.<br/>Resources: Site in PHP, XML and MySql with user control, restrict access to a photo gallery, Banner manager OpenX, Google Maps, Google Analytics, CSS3 and JQuery.",
                     "thumb":"img/portifolio/thumbs/portovelho.png",
                     "content":"img/portifolio/portovelho.png"
                  },
                  {
                     "title":"2007 - QuickSand",
                     "description":"Institutional Web-site.<br/>Resources: Adobe Flash - Actionscript 2, Javascript, PHP, MySQL.",
                     "thumb":"img/portifolio/thumbs/quick.png",
                     "content":"videos/quick.m4v"
                  },
                  {
                     "title":"2006 - Bunny's summer collection",
                     "description":"Institutional Web-site.<br/>Resources: Adobe Flash - Actionscript 2, Javascript, PHP, MySQL.",
                     "thumb":"img/portifolio/thumbs/bunnys3.png",
                     "content":"videos/bunnys3.m4v"
                  },
                  {
                     "title":"2006 - Bunny's winter collection",
                     "description":"Institutional Web-site.<br/>Resources: Adobe Flash - Actionscript 2, Javascript, PHP, MySQL.",
                     "thumb":"img/portifolio/thumbs/bunnys2.png",
                     "content":"videos/bunnys2.m4v"
                  },
                  {
                     "title":"2005 - Bunny's summer collection",
                     "description":"Institutional Web-site.<br/>Resources: Adobe Flash - Actionscript 2, Javascript, PHP, MySQL.",
                     "thumb":"img/portifolio/thumbs/bunnys1.png",
                     "content":"videos/bunnys1.m4v"
                  },
                  {
                     "title":"2005 - Club B!",
                     "description":"Institutional Web-site.<br/>Resources: Adobe Flash - Actionscript 2, Javascript, PHP, MySQL.",
                     "thumb":"img/portifolio/thumbs/clubb.png",
                     "content":"videos/clubb.m4v"
                  },
                  {
                     "title":"2010 - Gigabyte",
                     "description":"E-mail marketing.",
                     "thumb":"img/portifolio/thumbs/gigabyte.png",
                     "content":"img/portifolio/gigabyte.png"
                  }
               ]
            },
            {
               "title":"EDITORAÇÃO GRÁFICA",
               "grid":[
                  {
                     "title":"2003 - WIDO's Back Pack Manual",
                     "description":"Illustred Back Pack Manual.",
                     "thumb":"img/portifolio/thumbs/mochila.png",
                     "content":"img/portifolio/mochila.png"
                  },
                  {
                     "title":"2010 - Gelo Nevada's Brand Guideline ",
                     "description":"Brand Guideline for Gelo Nevada Company.",
                     "thumb":"img/portifolio/thumbs/gelonevada.png",
                     "content":"img/portifolio/gelonevada.png"
                  },
                  {
                     "title":"2004 - Citibank Club",
                     "description":"Citibank Advantage Club made in Adobe inDesign.",
                     "thumb":"img/portifolio/thumbs/citi.png",
                     "content":"pdf/citi.pdf"
                  },
                  {
                     "title":"2005 - Chora Brasil",
                     "description":"Graphic project for magazine Chora Brasil made in Adobe inDesign.",
                     "thumb":"img/portifolio/thumbs/chora.png",
                     "content":"pdf/chora.pdf"
                  }
               ]
            }
         ]
      }
   }
}