{
   "name":"Adriano Caversan",
   "title":"Computação Gráfica e Desenvolvimento de Aplicativos Multimídia",
   "pdf":"docs/adriano-caversan-frontend-ptbr.pdf",
   "profile":{
      "occupation":{
         "title":"Ocupação",
         "description":"Designer e Desenvolvedor de Aplicativos para Web, Iot, Games, Digital Signage e Multimídia."
      },
      "birth":{
         "title":"Nascimento",
         "description":"July 02, 1976"
      },
      "phone":{
         "title":"Fone/Whatsapp",
         "description":"+55 11 98091-0161"
      },
      "email":{
         "title":"E-mail",
         "description":"adriano.caversan@gmail.com"
      },
      "github":{
         "title":"GitHub",
         "description":"https://github.com/caversan"
      },
      "linkedin":{
         "title":"LinkedIn",
         "description":"https://www.linkedin.com/in/adriano-caversan/"
      },
      "address":{
         "title":"Endereço",
         "description":"São Paulo - SP"
      },
      "nationality":{
         "title":"Nacionalidade",
         "description":"Brasileiro"
      },
      "matrialstatus":{
         "title":"Estado civil",
         "description":"Casado"
      },
      "children":{
         "title":"Filhos",
         "description":"Sim"
      },
      "driverlicense":{
         "title":"Carteira de Motorista",
         "description":"cat. B"
      },
      "car":{
         "title":"Veículo Próprio",
         "description":"Sim"
      },
      "travel":{
         "title":"Disponibilidade para viagem",
         "description":"Sim (para viagens curtas)"
      },
      "move":{
         "title":"Disponibilidade para mudança",
         "description":"Sim (com a família)"
      }
   },
   "sections":{
      "opportunity":{
         "title":"Oportunidade desejada",
         "description":"Trabalhar com design ou desenvolvimento de software para web, desktop, IoT, jogos, sinalização digital e multimídia."
      },
      "profile":{
         "title":"Resuno Profissional",
         "description":"Sou um profissional de TI e Design com perfil generalista e mais de 25 anos de carreira, atuando principalmente em escritórios de desenvolvimento web, estúdios de jogos, produções audiovisuais e multimídia, agências de publicidade, sinalização digital, digital out of home (DOOH) e varejo online. Possuo profundo conhecimento nas etapas de desenvolvimento de software, com destaque para minha atuação como Desenvolvedor Frontend para web, jogos e multimídia. Também atuo como Designer, com foco em interfaces, UX/UI e animação 2D. Essa combinação entre TI e Design é uma trilha pouco explorada por profissionais de ambas as áreas, o que confere aos meus projetos grande fidelidade visual aliada à alta qualidade de código. Esse conhecimento integrado também me auxilia na criação de scripts para jogos e animações, essenciais para garantir maior fluidez e qualidade visual, além de acelerar significativamente o processo de entrega. Outro diferencial importante da minha carreira foi a oportunidade de atuar como integrador entre as equipes de Design e TI, elaborando especificações técnicas para arquivos de design, automatizando fluxos de entrega e gerando código automaticamente para a equipe de desenvolvimento. Essa integração aumentou substancialmente o volume de entregas, reduziu falhas e trouxe previsibilidade, qualidade e consistência a todo o processo de produção."
      },
      "skills":{
         "title":"Conhecimento técnico",
         "grid":[
            "<b>Desenvolvimento de Softwares:</b> Conhecimentos avançados: HTML5, Javascript, Typescript, CSS3, Python, PHP, C, C++, C#, .NET Framework, PHP, MQTT, AMQP, RabbitMQ, Kafka, Clean Code, SOLID, DRY, KISS, Algoritmos, Paradigmas, Powershell, Shell, Batch, Adobe Extended Script, Git, SVN, Wordpress, Drupal, Git Copilot, IA. Conhecimentos intermediários: React, Redux, Vue, Angular, Electron, Microsserviços, Microfrontend, NodeJS, Node-RED, Docker, Kubernetes, API REST, SOAP, gRCP, GraphQL, Design Patterns, GoF, Bancos de dados NoSQL e SQL, LGPD, análise de dados, algoritmos para Inteligência Artificial (Machine Learning, Deep Learning, análise visual, algoritmos genéticos, redes neurais). Conhecimentos básicos: DevOps e CI/CD, Github Actions, testes automatizados (TDD). Cloud (AWS, Lambda, GCP e OCI), (IaaS, PaaS, SaaS), Docker e Kubernetes, Infra as a Code (IaC), Segurança da informação, criptografia, JWT, Auth0, Observabilidade e Monitoramento (Datadog, Grafana), Arquitetura Limpa.<br/><br/>",
            "<b>Design e Web Marketing:</b> Photoshop, Krita, GIMP, Corel Draw, Illustrator, Inkscape, InDesign, XD, Figma, UX/UI, acessibilidade, padrões web, Bridge, Google Analytics, banners para web (ad-banners), mídia programática, campanhas em redes sociais, DCO, landing pages, métricas SEO, funis, jornada do consumidor, retail media.<br/><br/>",
            "<b>Metodologias de Projetos:</b> DDD, Event Storming, Brainstorming, Design Thinking, Kanban, Agile, SCRUM, Jira, Trello, Slack, Project, PMI, Waterfall, Six Sigma, Lean, Toyota.<br/><br/>",
            "<b>Engenharia de Computação e Eletrônica:</b> IoT, Industria 4.0, Cidades Inteligentes, mecatrônica, motores, geradores, baterias, resistência e mecânica dos materiais, ótica, física quântica, eletromagnetismo, química tecnológica, soldagem, microchips, componentes eletrônicos, portas de comunicação IO, protocolos de comunicação, análise de sinais, Firmware, CLP (Arduino, STM322 e ESP32), sensores, atuadores, metrologia.<br/><br/>",
            "<b>Animação, Jogos e Produção Audiovisual:</b> After Effects, DaVinci Resolve, Motionscript, GSAP, Google Web Designer (GWD), Adobe Animate, Milagro, Actionscript, jogos 2D e 3D, personagens e cenários, Unity, Godot, Pygame, Arte técnica, Level Design, GDD, Modelagem 3D, Texturas, Efeitos especiais, Blender, Spine, Première, Media Encoder, OBS, Audition, Sound Forge, Audacity, Kdenlive, estúdio audiovisual, câmeras, iluminação, cabeamento, mesas de edição linear e não linear, switchers, splitters, encoders de video, protocolos e codecs para transmissão via streaming on demand, broadcast e ao vivo, transmissão via satélite, desenvolvimento de software para mídia player para web, STB, IPTV e receptores satélite."
         ]
      },
      "languages":{
         "title":"Idiomas",
         "grid":[
            "Inglês (Avançado) B1 - TOEFL(2015) 450 pontos",
            "Espanhol (Leitura Técnica)",
            "Português (Nativo)"
         ]
      },
      "graduation":{
         "title":"Escolaridade",
         "grid":[
            {
               "title":"MBA - Engenharia de Software",
               "description":"USP/Esalq - início Fev/2024 - previsão de graduação em Dez/2025"
            },
            {
               "title":"Engenharia de Computação",
               "description":"Univesp - início Ago/2021 - previsão de graduação em Dez/2025"
            },
            {
               "title":"Bacharel em Tecnologia da Informação (IoT)",
               "description":"Univesp - início Ago/2021 - formado em Ago/2024"
            },
            {
               "title":"Tecnólogo em Análise de Sistemas (Ênfase em Jogos Digitais)",
               "description":"FATEC - início Ago/2011 - formado em Jul/2015"
            },
            {
               "title":"Bacharel em Publicidade e Propaganda",
               "description":"FIZO - início Fev/2009 - curso trancado no 3º semestre."
            },
            {
               "title":"Tecnólogo em Criação e Produção Gráfica Digital",
               "description":"Unip - início Ago/2006 - curso trancado no 4º semestre."
            },
            {
               "title":"Tecnólogo em Design de Multimídia",
               "description":"SENAC/SP - início Fev/2001 - curso trancado no 4º semestre."
            }
         ]
      },
      "courses":{
         "title":"Cursos e especializações",
         "grid":[
            {
               "title":"Disciplina Paulista de Acessibilidade e Inclusão",
               "description":"UNIVESP - 2025 (duração 80 horas)"
            },
            {
               "title":"Neurociências no ensino superior: estratégias para um desenvolvimento acadêmico saudável",
               "description":"USP - 2025 (duração 30 horas)"
            },
            {
               "title":"Redux, React Redux & Redux Toolkit RTK Course",
               "description":"Udemy - 2024 (duração 20 horas)"
            },
            {
               "title":"Web Moderno Completo: HTML, CSS, Javascript, React, NodeJs e mais",
               "description":"Udemy - 2020 (duração 88 horas)"
            },
            {
               "title":"AngularJS",
               "description":"Loiane.training – 2020 (duração 28 horas)"
            },
            {
               "title":"Arduino",
               "description":"Centro Paula Souza - Cetec - 2022 (duração 30 horas)"
            },
            {
               "title":"Democracia Digital",
               "description":"FGV e nic.br - 2022 (duração 5 horas)"
            },
            {
               "title":"Introdução ao Javascript",
               "description":"Fundação Bradesco - 2022 (duração 20 horas)"
            },
            {
               "title":"Desvendando o 5G",
               "description":"Senai - 2022 (duração 15 horas)"
            },
            {
               "title":"Desvendando o Blockchain",
               "description":"Senai - 2022 (duração 20 horas)"
            },
            {
               "title":"HTML e CSS",
               "description":"Fundação Bradesco - 2022 (duração 24 horas)"
            },
            {
               "title":"Inovando com CSS",
               "description":"Fundação Bradesco - 2022 (duração 26 horas)"
            },
            {
               "title":"Introdução à Ciência de Dados",
               "description":"FGV - 2022 (duração 60 horas)"
            },
            {
               "title":"Proteção de Dados",
               "description":"FGV e nic.br - 2022 (duração 5 horas)"
            },
            {
               "title":"Segurança Digital",
               "description":"FGV e nic.br - 2022 (duração 5 horas)"
            },
            {
               "title":"Oficina de desenho",
               "description":"Escola de Artes de Osasco - SP - 2006 (duração 60 horas)"
            },
            {
               "title":"Filmagem e direção",
               "description":"Senac - SP - 2003 (duração 20 horas)"
            },
            {
               "title":"Oficina de games",
               "description":"Senac - SP - 2002 (duração 1 ano)"
            },
            {
               "title":"Lightwave 3D modelagem e animação",
               "description":"Senac - SP - 2002 (duração 60 horas)"
            },
            {
               "title":"Web Design",
               "description":"Senac - SP - 2000 (duração 96 horas)"
            },
            {
               "title":"Artes Gráficas e Ilustração",
               "description":"Fundação Bradesco - 1992 (duração 960 horas)"
            }
         ]
      },
      "experience":{
         "title":"Experiência profissional",
         "grid":[
            {
               "title":"Eletromidia S/A - nov/2022 até o mar/2025<br/>Cargo: Desenvolvedor Frontend Senior",
               "description":"<b>Atribuições: </b>Coordenação e mentoria de estagiários e trainees; referência técnica no desenvolvimento de frontend para animação e rich media; levantamento de requisitos técnicos para o desenvolvimento de frontend e animações HTML5; desenvolvimento de software para sinalização digital usando React, Redux, Electron e NodeJS; conversão de código legado em Flash Actionscript para tecnologias web modernas; animação utilizando HTML5, CSS3, JavaScript, GSAP, Adobe Animate, Milagro, Google Web Designer; projetos especiais de alto impacto para digital signage envolvendo video wall, led matrix e equipamento audiovisual profissional; integração do frontend com APIs de dados para consumo dinâmico de texto, imagem e vídeo; manipulação de material gráfico utilizando Adobe Photoshop, Adobe After Effects e Adobe Illustrator; renderização avançada de vídeo utilizando FFMPEG e Adobe Media Encoder; automação de conversão de mídia utilizando scripts FFMPEG e Python.",
               "link":"https://eletromidia.com.br/"
            },
            {
               "title":"Hogarth Worldwide - jun/2021 até out/2022<br/>Cargo: Desenvolvedor Frontend Senior",
               "description":"<b>Atribuições: </b>Animação de banners publicitários dinâmicos ou estáticos utilizando, HTML5, CSS3 e frameworks de animação JavaScript como GSAP, Adobe Animate, Milagro, Google Web Designer; manipulação de material gráfico utilizando Adobe Bridge, Adobe Photoshop, Adobe After Effects e Adobe Illustrator; variação de formatos de banners garantindo alta vazão e consistência gráfica entre as peças; automatização de processos de otimização de imagens para web; entrega alto volume de banners publicitários em mais de 150 projetos e suas variações de formato para empresas como Bayer, L'Oréal, Coca-Cola, BMW, Amex, Jameson, entre outras.",
               "link":"https://hogarth.com/"
            },
            {
               "title":"IGS International Solutions - set/2015 até nov/2019<br/>Cargo: Designer Sênior (Líder Artistas Técnicos)",
               "description":"<b>Atribuições: </b>Especialista em projetos de jogos de cassino utilizando Adobe Extended Script, Adobe After Effects, Adobe Animate e Adobe Photoshop e Adobe Illustrator, Adobe Audition, C, C++, Godot, Spine; desenvolvimento de scripts para automação e otimização da criação de multimídia utilizando Adobe Extended Script, Javascript, Python, Batch Script, Powershell, Shell, Visual Basic, FFMPEG, ImageMagick e PNG Gauntlet; atualização tecnológica e remasterização de jogos legados dos anos 80 e 90, com base em tecnologias legadas como MS-DOS, Windows XP, C e C++ bem como formatos legados de som, vídeo e imagem; efeitos especiais para gabinetes de jogos utilizando controladores IoT para interação em tempo real do jogo com fitas de led e efeitos sonoros; animação personagens e elementos gráficos do jogo; liderança da equipe de Tech Artists, fornecendo todo o conteúdo criativo para a plataforma de jogos.",
               "link":"https://ortizgaming.com/"
            },
            {
               "title":"Atmo Mídia Digital Corporativa - set/2013 até set/2015<br/>Cargo: Programador Flash",
               "description":"<b>Atribuições: </b>Análise e desenvolvimento de sistemas para Digital Signage, totens e multimídia, sistemas para streaming de vídeo sob demanda ou ao vivo, transmissão via web ou via satélite pelo sistema de TV Digital usando FFMPEG, OBS e Adobe Media Encoder; configuração e otimização de sistemas operacionais para Windows, Linux e Android; projetos especiais de alto impacto para digital signage envolvendo video wall, led matrix, equipamento audiovisual profissional; testes e levantamento de requisitos e manutenção preventiva de hardware; programação para sistemas embarcados e dispositivos de sinalização digital usando, Actionscript 3, .Net Framework, C# e C++, utilização de portas seriais para comunicação IO, atualizações de Firmware. Integração do frontend com APIs de dados para consumo dinâmico de texto, imagem e vídeo; manipulação de material gráfico utilizando Adobe Photoshop, Adobe After Effects e Adobe Illustrator; cases de grandes empresas nacionais como Magalu, Habib’s, Cacau Show, Polícia Militar do Estado de São Paulo, KPMG, Casas Bahia, Ri Happy, Bodytech, DASA, Natura, Bayer.",
               "link":"https://atmodigital.com.br/"
            },
            {
               "title":"Unidas Rent a Car - jun/2013 até set/2013<br/>Cargo: Analista de Marketing Digital",
               "description":"<b>Atribuições: </b>Coordenação de projetos para mídia on-line; construção e manutenção dos portais corporativos em HTML, CSS e Javascript, Wordpress e Adobe Flash; integração com APIs de serviços de redes sociais; criação de animações para banners e landing pages utilizando Adobe Flash, Actionscript e gif; monitoramento, análise de métricas e otimização SEO; produção de email marketing; realização de testes A/B.",
               "link":"https://unidas.com.br"
            },
            {
               "title":"Elemidia Empresas - ago/2007 até mai/2013<br/>Cargo: Programador",
               "description":"<b>Atribuições: </b>Programação Actionscript 2 para a manutenção e desenvolvimento de novas funcionalidades para software de Digital Signage e Tv Corporativa da Elemidia Empresas; layouts para as interfaces de TV Corporativa baseadas na identidade visual do cliente; animações e vinhetas em 2D, tratamento e edição de vídeo utilizando Adobe Flash,  After Effects e FFMPEG; integração do frontend com APIs de dados para consumo dinâmico de texto, imagem e vídeo; manipulação de material gráfico utilizando Adobe Photoshop, Adobe After Effects e Adobe Illustrator; cases de grandes empresas nacionais e multinacionais com participação em mais de 300 projetos como Nokia, Abril, Unilever, Volkswagen, Philips, Abbott, Syngenta entre outros.",
               "link":"https://eletromidia.com.br/"
            },
            {
               "title":"<i>Experiências Anteriores - jan/2000 até dez/2007<br/>Empresas: Editoras Gráficas, Agências de Publicidade e Projetos Freelancer como Web Designer, Designer de Multimídia e Desenvolvedor Frontend.</i>",
               "description":"<i><b>Atribuições: </b>Gestão de projetos, análise de custos para web e multimídia; cobertura jornalística de foto e vídeo para feiras, eventos sociais e corporativos; montagem de equipamentos audiovisual, montagem de ilumunação; contratação de profissionais e equipamentos para projetos de fotografia e audiovisual; direção de estúdio de foto e vídeo analógico e digital; design, desenvolvimento e manutenção de sites estáticos e dinâmicos; criação de backend para conteúdo e serviços dinâmicos como fórum, enquetes, salas de chat, formulário de contato, álbum de imagens; integração com APIs de notícias; controle e manutenção de hospedagem utilizando o CPanel e Linux; criação de animações para banners e landing pages e materiais corporativos; animação 3D; edição de imagens, áudio e vídeo;  produção e envio de email marketing; monitoramento, análise de métricas e otimização SEO; realização de testes A/B; suporte ao usuário.</i>",
               "link":""
            }
         ]
      },
      "portifolio":{
         "title":"Alguns trabalhos realizados",
         "grid":[
            {
               "title":"AD BANNERS",
               "grid":[
                  {
                     "title":"entre 2020 e 2022",
                     "description":"Criação de banners publicitários dinâmicos ou estáticos utilizando Adobe Creative Suite, HTML5, CSS3 e frameworks de animação JavaScript como GSAP, Adobe Animate, Milagro, Google Web Designer.",
                     "thumb":"img/portifolio/thumbs/banners.png",
                     "content":"videos/banners.mp4"
                  }
               ]
            },
            {
               "title":"DIGITAL SIGNAGE",
               "grid":[
                  {
                     "title":"entre 2007 e 2015",
                     "description":"Criação e desenvolvimento do software de digital signage, rádio virtual e TV corporativa para Elemidia Empresas e Atmo. A aplicação foi desenvolvida em .Net, Actionscript, Batch Script, Powershell e JavaScript totalmente parametrizada afim de agilizar a replicação do software em vários clientes e modular para que o software pudesse ser personalizado além de um watchdog (controle de falhas) construído para este ser executado de forma estável em hardware limitado.",
                     "thumb":"img/portifolio/thumbs/digital_signage.png",
                     "content":"videos/digital_signage.m4v"
                  }
               ]
            },
            {
               "title":"WEB",
               "grid":[
                  {
                     "title":"2010 - Mantu",
                     "description":"Web-site para casa de shows.<br/>Recursos utilizados: Site em PHP, XML e MySql com cadastro de usuários, acesso restrito ao albúm de fotos, Gerenciador de banners OpenX, integração com a API do Google Maps, Google Analytics, além de recursos avançados de CSS3 e JQuery.",
                     "thumb":"img/portifolio/thumbs/mantu.png",
                     "content":"img/portifolio/mantu.png"
                  },
                  {
                     "title":"2010 - Porto Velho Bar",
                     "description":"Web-site casa de shows.<br/>Recursos utilizados: Animação do lay-out no flash, integração do flash com o XML a fim de facilitar a atualização do conteúdo. Carregamento do site otimizado afim de primeiro carregarmos primeiro o conteúdo de maior importância e por último as imagens e planos de fundo, esta página possui uma versão mobile que é acessada automaticamente quando o acesso não provenha de um desktop.",
                     "thumb":"img/portifolio/thumbs/portovelho.png",
                     "content":"img/portifolio/portovelho.png"
                  },
                  {
                     "title":"2007 - QuickSand",
                     "description":"Web-site institucional para Fabricante de calçados.<br/>Recursos utilizados: Animação do lay - out no flash, tratamento de imagens, foto montagem.Com o uso do Photoshop o logotipo da empresa foi inserido em diversas montagens.O carro deste thumbnail por exemplo era preto e não tinha a pintura do fogo que foi inserida a partir da foto de uma fogueira.",
                     "thumb":"img/portifolio/thumbs/quick.png",
                     "content":"videos/quick.m4v"
                  },
                  {
                     "title":"2006 - Bunny's verão",
                     "description":"Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                     "thumb":"img/portifolio/thumbs/bunnys3.png",
                     "content":"videos/bunnys3.m4v"
                  },
                  {
                     "title":"2006 - Bunny's inverno",
                     "description":"Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                     "thumb":"img/portifolio/thumbs/bunnys2.png",
                     "content":"videos/bunnys2.m4v"
                  },
                  {
                     "title":"2005 - Bunny's verão",
                     "description":"Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                     "thumb":"img/portifolio/thumbs/bunnys1.png",
                     "content":"videos/bunnys1.m4v"
                  },
                  {
                     "title":"2005 - Club B!",
                     "description":"Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                     "thumb":"img/portifolio/thumbs/clubb.png",
                     "content":"videos/clubb.m4v"
                  },
                  {
                     "title":"2010 - Gigabyte",
                     "description":"Email marketing.",
                     "thumb":"img/portifolio/thumbs/gigabyte.png",
                     "content":"img/portifolio/gigabyte.png"
                  }
               ]
            },
            {
               "title":"EDITORAÇÃO GRÁFICA",
               "grid":[
                  {
                     "title":"2003 - Manual Mochila WIDO",
                     "description":"Manual de Instruções ilustrado.",
                     "thumb":"img/portifolio/thumbs/mochila.png",
                     "content":"img/portifolio/mochila.png"
                  },
                  {
                     "title":"2010 - Identidade Visual Gelo Nevada",
                     "description":"Identidade Visual para a empresa Gelo Nevada.",
                     "thumb":"img/portifolio/thumbs/gelonevada.png",
                     "content":"img/portifolio/gelonevada.png"
                  },
                  {
                     "title":"2004 - Citibank Club",
                     "description":"Catálogo para clube de vantagens do Citibank produzido no Adobe inDesign.",
                     "thumb":"img/portifolio/thumbs/citi.png",
                     "content":"pdf/citi.pdf"
                  },
                  {
                     "title":"2005 - Chora Brasil",
                     "description":"Projeto gráfico e editorial para a revista Chora Brasil produzido no Adobe inDesign.",
                     "thumb":"img/portifolio/thumbs/chora.png",
                     "content":"pdf/chora.pdf"
                  }
               ]
            }
         ]
      }
   }
}