{
    "name": "Adriano Caversan",
    "title": "Computação Gráfica e Desenvolvimento de Aplicativos Multimídia",
    "pdf": "docs/adriano-caversan-cv-ptbr.pdf",
    "profile": {
        "occupation": {
            "title": "Ocupação",
            "description": "Designer e Desenvolvedor de Aplicativos para Web, Games, Digital Signage e Multimídia."
        },
        "birth": {
            "title": "Nascimento",
            "description": "July 02, 1976"
        },
        "phone": {
            "title": "Fone/Whatsapp",
            "description": "+55 11 98091-0161"
        },
        "email": {
            "title": "E-mail",
            "description": "adriano.caversan@gmail.com"
        },
        "address": {
            "title": "Endereço",
            "description": "Parque Continental, Zona Oeste de São Paulo."
        },
        "nationality": {
            "title": "Nacionalidade",
            "description": "Brasileiro"
        },
        "matrialstate": {
            "title": "Estado civil",
            "description": "Casado"
        },
        "children": {
            "title": "Filhos",
            "description": "Sim"
        },
        "driverlicense": {
            "title": "Carteira de Motorista",
            "description": "cat. B"
        },
        "car": {
            "title": "Veículo Próprio",
            "description": "Sim"
        },
        "travel": {
            "title": "Disponibilidade para viagem",
            "description": "Sim (para viagens curtas)"
        },
        "move": {
            "title": "Disponibilidade para mudança",
            "description": "Sim (com a família)"
        }
    },
    "sections": {
        "opportunity": {
            "title": "Oportunidade desejada",
            "description": "Trabalhar com criação e desenvolvimento de sistemas para web, audiovisual, jogos e multimídia."
        },
        "profile": {
            "title": "Perfil profissional",
            "description": "Com perfil generalista possuo amplo conhecimento nas etapas envolvidas na coordenação, produção e criação em projetos para web, jogos, multimídia e audiovisual. Atuo tanto na área de Design quanto em programação o que é um perfil raro no mercado. Além de ter aptidão artistica, possuo contato direto com micro-informática desde 1986 começando a utiliza-la profissionalmente a partir de 1993. No ano 1998 comecei à me concentar nos estudos da computação gráfica e no ano 2000 à programação principalmente para Web e Multimídia e, a partir de 2007, à Digital Signage. Apesar de já ter desenvolvido jogos antes de 2010, foi neste ano que passei dar maior atenção à esta área afim de juntar meu conhecimento em arte e em programação."
        },
        "skills": {
            "title": "Conhecimento técnico",
            "description": "Conhecimentos avançados de programação para frontend web, multimídia e de jogos, conhecimentos básicos do backend garantindo um perfil fullstack, especialista no pacote Adobe Creative Suite, scripts para manipulação em lote, programação de aplicativos desktop para windows .net. Experiência em agências digitais web e multimídia, publicidade, estúdios criativos e estúdio de jogos. Experiência em startups que se tornaram unicórnios digitais. Conhecimentos em ao menos uma ferramenta opensource para cada tecnologia conhecida garantindo baixo custo de licenciamento de software.",
            "grid": [{
                    "title": "ÁUDIO",
                    "description": "Captura, mixagem, sintetização, edição, efeitos especiais, sincronização de áudio e vídeo, encoding, maipulação em lote. Transmissão web ondemand e broadcast, players desktop para rádio corporativa e som ambiente. Tecnologias: Sound Forge, Audacity, Adobe Audition, Ardour"
                },
                {
                    "title": "VÍDEO/PRODUÇÃO",
                    "description": "Direção, filmagem, edição, linear e não linear, produção e pós-produção, efeitos especiais, motionscript, encoding scripts de renderização em lote. Transmisão de vídeo ao vivo por streaming broadcast e ondemand, web players e desktop players para TV Corporativa e Digital Signage Tecnologias: Adobe Première, Sony Vegas Vídeo, VirtualDub, FFMPEG, Kdenlive, Natron, Open Broadcaster Software | OBS, Adobe Media Encoder, Blackmagic "
                },
                {
                    "title": "3D",
                    "description": "Modelagem, animação, render, esqueletos, efeitos físicos, iluminação e cenário, adobe flash e director, motionscript, scripts de renderização em lote, programação e games. Tecnologias: Blender, Unity 3D, 3D Max, Lightwave, Maya, VRML e X3D, Web GL, (AS3) Flash 3, (LINGO) Director 3D"
                },
                {
                    "title": "ANIMAÇÃO/PÓS-PRODUÇÃO",
                    "description": "Conceito e teoria da animação e análise do movimento, flash, actionscript, 3D, after-effects, motionscript. Tecnologias: Adobe After Effects, Adobe Flash, Adobe Animator, Spine, Black Magic Davinci Resolve, Black Magic Fusion"
                }, {
                    "title": "DIGITAL SIGNAGE E MULTIMÍDIA",
                    "description": "Conteúdo audiovisual interativo ou não para Outernet, Digital Signage indoor e outdoor, Publicidade Out of Home (DOOH), Cd-Rom, Totens, Stand para feiras e eventos, Ad games, DVD, apresentações audiovisuais para pequenos e grandes eventos, TV Corporativa. Tecnologias: Adobe Flash, Unity 3D, Macromedia Director, Godot, Visual Studio, Qt, NodeJS"
                }, {
                    "title": "ILUSTRAÇÃO E TIPOGRAFIA",
                    "description": "Mão livre, bitmap e vetorial, ilustração e catoon. Iconografia (criação de ícones exclusivos) Logotipo e manual de marca, fontes para tipografia exclusiva. Tecnologias: Adobe Illustrator, Free Hand, Corel Draw, Painter, InkScape, Krita, Gimp, Adobe Photoshop, Fontographer, FontForge"
                }, {
                    "title": "EDITORAÇÃO GRÁFICA",
                    "description": "Elaboração de material gráfico impresso como folhetos, cartazes, jornais, revistas, brindes e embalagens. Tecnologias: Adobe Indesign, Adobe Page Maker, Adobe Acrobat, Scribus"
                }, {
                    "title": "FOTOGRAFIA",
                    "description": "Conhecimento técnico e teórico de foto analógica e digital, técnicas de iluminação e estúdio, scripts de manipulação de imagens em lote, edição e tratamento de imagem, script de tratamento de imagens em lote. Tecnologias: Estúdio e iluminação, Fotografia luz natural, Fotojornalismo, Adobe Photoshop, Gimp"
                }, {
                    "title": "PROGRAMAÇÃO E BANCO DE DADOS",
                    "description": "ActionScript 2 e ActionScript 3, conteúdo dinâmico PHP/MySql, CSS2 e CSS3, tableless, APIs do Google, JQuery, Ajax, Frameworks JavaScript, aplicativos para desktop. Tecnologias: DHTML, ActionScript 1, 2 e 3, ASP, PHP, CGI, Javascript, Lingo, .Net, C#, C,C++, Java / Android, Python/Pygame, MySQL, Access, Qt"
                }, {
                    "title": "JOGOS",
                    "description": "Jogos para as mais variadas plataformas e para os mais variados públicos: Consoles, internet, publicidade (Ad games), mobile, e-learning e treinamento corporativo. Artista Técnico, geração de texturas e mapas de sprites, fontes e conteúdo audiovisual, criação de asssets para jogos, programação das mecânicas de jogo, efeitos especiais, efeitos físicos, movimentos. Level design Tecnologias: Adobe Flash CS5 / AS2 AS3, Macromedia Director 2D/3D, Unity 3D / C#, Godot, Unreal, XNA, Java / Android, Pygame / Blender 3D, C C++, Texture Packer"
                }, {
                    "title": "EDITORAÇÃO WEB E FRONTEND",
                    "description": "Criação de sites responsivos e multiplataforma utilizando sempre as últimas tendências de frontend. Tecnologias: Drupal, Wordpress, XHTML, HTML 3, 4 e 5, CSS, XML, Javascript(Puro e Frameworks), Angular, Jquery, Json, Adobe Dreamweaver, VS Code, Google Analitics e SEO"
                }, {
                    "title": "SISTEMAS OPERACIONAIS",
                    "description": "Usuário avançado e administrador de sistemas, conhecimento abrangente do funcionamento software/hardware, otimização de sistemas, redes, segurança e diretivas de grupo. Tecnologias: MacOS, Linux, Windows, Android, Powershell, Batch e Shell"
                }
            ]
        },
        "languages": {
            "title": "Idiomas",
            "grid": ["Inglês (Avançado) - TOEFL(2015) 450 pontos", "Espanhol (Leitura Técnica)", "Português (Nativo)"]

        },
        "graduation": {
            "title": "Escolaridade",
            "grid": [{
                "title": "Superior em Análise de Sistemas (Ênfase em Jogos Digitais)",
                "description": "FATEC/SP - início Ago/2011 - formado em Jul/2015 - Título Técnólogo."
            }, {
                "title": "Superior em Publicidade e Propaganda",
                "description": "FIZO - início Fev/2009 - curso trancado no 3º semestre."
            }, {
                "title": "Superior em Criação e Produção Gráfica Digital",
                "description": "Unip - início Ago/2006 - curso trancado no 4º semestre."
            }, {
                "title": "Superior em Design de Multimídia",
                "description": "SENAC/SP - início Fev/2001 - curso trancado no 4º semestre."
            }]
        },
        "courses": {
            "title": "Cursos e especializações",
            "grid": [{
                "title": "AngularJS",
                "description": "Loiane.training – 2020 (duração 28 horas)."
            }, {
                "title": "Web Moderno Completo",
                "description": "Udemy - 2020 (duração 88 horas)"
            }, {
                "title": "Oficina de desenho",
                "description": "Escola de artes de Osasco - SP - 2006 (duração 60 horas)."
            }, {
                "title": "Filmagem e direção",
                "description": "Senac - SP - 2003 (duração 20 horas)."
            }, {
                "title": "Oficina de game",
                "description": "Senac - SP - 2002 (grupo de estudos - duração 1 ano)."
            }, {
                "title": "Lightwave 3D modelagem e animação",
                "description": "Senac - SP - 2002 (duração 60 horas)."
            }, {
                "title": "Curso de Web Design",
                "description": "Senac - SP - 2000 (duração 96 horas)."
            }, {
                "title": "Curso de Artes Gráficas",
                "description": "Fundação Bradesco - 1992 (duração 12 meses)."
            }]
        },
        "experience": {
            "title": "Experiência profissional",
            "grid": [{
                "title": "Set/2015 até hoje na IGS International Solutions - Cargo: Designer Sênior (Líder Artistas Técnicos)",
                "description": "Atribuições:<br/>Especialista Adobe em desenvolvimento de jogos digitais. Desenvolvimento de scripts para automatizar e otimizar a criação de conteúdo gráfico para jogos utilizando ffmpeg, imagemagick, javascript, batch e shell script. Prover as posições e características das animações feitas no after effects de forma automatizada por meio de xml, json motionscript e Adobe Extend Script que no final é importado pela engine de jogos. Suprir a engine de jogos com todo material gráfico e audiovisual. Participação no projeto de modernização tecnológica e remasterização visual de todo o portifólio de jogos da Ortiz Gaming tendo contato com a plataforma legada feita para MS-DOS e C em baixa resolução e tecnologias das décadas de 80 e 90.",
                "link": "http://www.ortizgaming.com/"
            }, {
                "title": "Set/2013 até Set/2015 na Atmo Mídia Digital Corporativa - Cargo: Programador Flash",
                "description": "Atribuições:<br/> - Análise e desenvolvimento de sistemas para Digital Signage, totens e multimídia além de sistemas para streaming de vídeo e vídeo sob demanda ou ao vivo; <br/> -Configuração e otimização de ambientes baseados em windows, linux, android e java; <br/> -Pesquisa, desenvolvimento e homologação de ambientes de hardware baseados nas arquiteturas ARM e x86 para decoders de video e thin clients para digital signage, totens e multimídia; <br/> -Coordenação da equipe de implantação e manutenção de hardware e software; <br/> -Negociação técnica de itens de hardware e software com fornecedores e prestadores de serviços no brasil e no exterior.",
                "link": "http://www.atmodigital.com.br/"
            }, {
                "title": "Jun/2013 até Set/2013 na Unidas Rent a Car - Cargo: Analista de Marketing Digital.",
                "description": "Atribuições:<br/> -Coordenação de projetos para mídia on - line; <br/>-Análise de métricas do portal Unidas; <br/>-Análise de sistemas web; <br/>-Manutenção de conteúdo do portal Unidas; <br/>-Layouts para mídia on - line e impressa; <br/>-Edição e tratamento de vídeo; <br/>-Produção de e-mail Marketing.",
                "link": "http://www.unidas.com.br"
            }, {
                "title": "Ago/2007 até Mai/2013 na Elemidia Empresas - Cargo: Programador",
                "description": "Atribuições: <br/> -Programação Actionscript 2 para a manutenção e desenvolvimento de novas funcionalidades para software de Digital Signage e Tv Corporativa da Elemidia Empresas;<br/>-Layouts para o softwares de TV Corporativa baseados na identidade visual do cliente; <br/>-Animações e vinhetas em 2 D; <br/>-Edição e tratamento de vídeo; <br/>-Cases de grandes empresas nacionais e multinacionais.Participação em mais de 250 projetos.",
                "link": "http://www.elemidia.com.br"
            }, {
                "title": "Nov/2006 até Mar/2007 na Edições Paulinas - Cargo: Web-Designer.",
                "description": "Atribuições:<br/> Atualização do conteúdo do Portal Paulinas envolvendo banners e aplicações em flash, aplicações em ASP, conteúdo audiovisual, suporte ao internauta, html, css, imagens.",
                "link": "http://www.paulinas.org.br/"
            }, {
                "title": "Set/2005 até Nov/2006 na LC2 (parceria com a TCPcom) Cargo: Web-Developer Pleno.",
                "description": "Atribuições:<br/> Diagramação e produção de web - sites institucionais, hot-sites, web - sites dinâmicos, banco de dados, web-marketing, suporte técnico, revenda de hospedagem, cPanel, atualização, alguns trabalhos gráficos e de multimídia.",
                "link": ""
            }, {
                "title": "Dez/2004 até Ago/2005 Cargo: Bit-Click Photo Digital Cargo: Operador de Vídeo.",
                "description": "Atribuições: <br/> -Cobertura de foto e vídeo em feiras, eventos e festas, edição de vídeo, efeitos especiais, vinhetas.",
                "link": ""
            }, {
                "title": "Nov/2002 até Dez/2004 na Yazz Design Cargo: Diretor de arte - Multimídia.",
                "description": "Atribuições:<br/> Gerência de projetos e análise de custos para web e multimídia, produção em web multimídia, artes gráficas, ilustração, diagramação, coordenação de equipe para foto e vídeo, suporte ao cliente.",
                "link": "http://www.yazz.com.br"
            }, {
                "title": "Abril/2002 até Out/2002 na Dialeto Comunicação Cargo: Web-Designer.",
                "description": "Atribuições:<br/> Diagramação e produção de web - sites institucionais, hot-sites, web - sites dinâmicos, web-marketing, suporte técnico, atualização, alguns trabalhos gráficos e de multimídia",
                "link ": ""
            }, {
                "title": "Nov/2000 até Dez/2001 na TCPcom Ltda Cargo: Web-Designer",
                "description": "Atribuições:<br/>Diagramação e produção de web - sites institucionais, hot-sites, web-marketing, suporte técnico, atualização, desenho técnico(AutoCad), alguns trabalhos gráficos e de multimídia. <br/> ",
                "link": ""
            }]
        },
        "portifolio": {
            "title": "Alguns trabalhos realizados",
            "grid": [{
                    "title": "WEB",
                    "grid": [{
                        "title": "2010 - Mantu",
                        "description": "Web-site para casa de shows.<br/>Recursos utilizados: Site em PHP, XML e MySql com cadastro de usuários, acesso restrito ao albúm de fotos, Gerenciador de banners OpenX, integração com a API do Google Maps, Google Analytics, além de recursos avançados de CSS3 e JQuery.",
                        "thumb": "img/portifolio/thumbs/mantu.jpg",
                        "content": "img/portifolio/mantu.jpg"
                    }, {
                        "title": "2010 - Porto Velho Bar",
                        "description": "Web-site casa de shows.<br/>Recursos utilizados: Animação do lay-out no flash, integração do flash com o XML a fim de facilitar a atualização do conteúdo. Carregamento do site otimizado afim de primeiro carregarmos primeiro o conteúdo de maior importância e por último as imagens e planos de fundo, esta página possui uma versão mobile que é acessada automaticamente quando o acesso não provenha de um desktop.",
                        "thumb": "img/portifolio/thumbs/portovelho.jpg",
                        "content": "img/portifolio/portovelho.jpg"
                    }, {
                        "title": "2007 - QuickSand",
                        "description": "Web-site institucional para Fabricante de calçados.<br/>Recursos utilizados: Animação do lay - out no flash, tratamento de imagens, foto montagem.Com o uso do Photoshop o logotipo da empresa foi inserido em diversas montagens.O carro deste thumbnail por exemplo era preto e não tinha a pintura do fogo que foi inserida a partir da foto de uma fogueira.",
                        "thumb": "img/portifolio/thumbs/quick.jpg",
                        "content": "img/portifolio/quick.jpg"
                    }, {
                        "title": "2006 - Bunny's verão",
                        "description": "Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                        "thumb": "img/portifolio/thumbs/bunnys3.jpg",
                        "content": "img/portifolio/bunnys3.jpg"
                    }, {
                        "title": "2006 - Bunny's inverno",
                        "description": "Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                        "thumb": "img/portifolio/thumbs/bunnys2.jpg",
                        "content": "img/portifolio/bunnys2.jpg"
                    }, {
                        "title": "2005 - Bunny's verão",
                        "description": "Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                        "thumb": "img/portifolio/thumbs/bunnys1.jpg",
                        "content": "img/portifolio/bunnys1.jpg"
                    }, {
                        "title": "2005 - Club B!",
                        "description": "Web-site institucional para rede de lojas de moda.<br/>Recursos utilizados: Animação do lay-out no flash, sonorização, tratamento de imagens, formulário de contato em asp.",
                        "thumb": "img/portifolio/thumbs/clubb.jpg",
                        "content": "img/portifolio/clubb.jpg"
                    }, {
                        "title": "2002 - JAD Logística",
                        "description": "Web-Site institucional em Flash.",
                        "thumb": "img/portifolio/thumbs/jad.jpg",
                        "content": "img/portifolio/jad.jpg"
                    }, {
                        "title": "2010 - Gigabyte",
                        "description": "Email marketing.",
                        "thumb": "img/portifolio/thumbs/gigabyte.jpg",
                        "content": "img/portifolio/gigabyte.jpg"
                    }]
                },
                {
                    "title": "DIGITAL SIGNAGE",
                    "grid": [{
                        "title": "2009 - Philips",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/philips.jpg",
                        "content": "img/portifolio/philips.jpg"
                    }, {
                        "title": "2009 - Atlantica Hotels",
                        "description": "Software para Digital Signage feito em actionscript. Criação do conceito de arte e desenvolvimento do layout para o software.",
                        "thumb": "img/portifolio/thumbs/atlantica.jpg",
                        "content": "img/portifolio/atlantica.jpg"
                    }, {
                        "title": "2009 - Unilever",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/unilever.jpg",
                        "content": "img/portifolio/unilever.jpg"
                    }, {
                        "title": "2009 - GV Riscos",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/gvriscos.jpg",
                        "content": "img/portifolio/gvriscos.jpg"
                    }, {
                        "title": "2009 - FEMSA",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/femsa.jpg",
                        "content": "img/portifolio/femsa.jpg"
                    }, {
                        "title": "2009 - NOKIA",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/nokia.jpg",
                        "content": "img/portifolio/nokia.jpg"
                    }, {
                        "title": "2009 - Roche",
                        "description": "Software para Digital Signage feito em actionscript. Adequação do layout proposto para o software.",
                        "thumb": "img/portifolio/thumbs/roche.jpg",
                        "content": "img/portifolio/roche.jpg"
                    }]
                },
                {
                    "title": "JOGOS",
                    "grid": [{
                        "title": "2001 - Cachorro",
                        "description": "Jogo infantil feito em flash. Atualmente está transcrito para Javascript no intuito de torná-lo jogável na web moderna.",
                        "thumb": "img/portifolio/thumbs/cachorro.jpg",
                        "content": "jogos/cachorro/cachorro.htm"
                    }, {
                        "title": "2013 - Caversan Mines",
                        "description": "Jogo de campo minado feito em flash. Atualmente está transcrito para Javascript no intuito de torná-lo jogável na web moderna.",
                        "thumb": "img/portifolio/thumbs/mines.jpg",
                        "content": "jogos/mines/mines.htm"
                    }, {
                        "title": "2013 - Protótipo Jogo da Memória",
                        "description": "Protótipo de jogo da memória feito em Javascript.",
                        "thumb": "img/portifolio/thumbs/memo.jpg",
                        "content": "jogos/memo/memo.htm"
                    }, {
                        "title": "2013 - Estudo de Jogo em Unity",
                        "description": "Estudo de jogo em primeira pessoa feito em Unity 3D. (Requer plugin UNITY 3D).",
                        "thumb": "img/portifolio/thumbs/ilha.jpg",
                        "content": "jogos/ilha/ilha.htm"
                    }]
                },
                {
                    "title": "ILUSTRAÇÃO, LOGOTIPAGEM E ICONOGRAFIA",
                    "grid": [{
                        "title": "2007 - Iconografia para TV Corporativa Nokia",
                        "description": "Coleção de ícones para ilustrar a interface gráfica do canal de comunicação corporativa da Nokia.",
                        "thumb": "img/portifolio/thumbs/iconesnokia.jpg",
                        "content": "img/portifolio/iconesnokia.jpg"
                    }, {
                        "title": "2007 - Logotipo para TV Corporativa Unilever",
                        "description": "Proposta de logotipo para canal de comunicação corporativa da Unilever.",
                        "thumb": "img/portifolio/thumbs/tvu.jpg",
                        "content": ""
                    }, {
                        "title": "2007 - Iconografia para TV Corporativa",
                        "description": "Proposta de iconografia para canal de comunicação corporativa.",
                        "thumb": "img/portifolio/thumbs/iconestransito.jpg",
                        "content": ""
                    }, {
                        "title": "2007 - Logotipo para ISS Fácil",
                        "description": "Logotipo para software de arrecadação fiscal da Prefeitura de Petrópolis.",
                        "thumb": "img/portifolio/thumbs/istbs.jpg",
                        "content": ""
                    }]
                },
                {
                    "title": "BANNERS",
                    "grid": [{
                        "title": "2002 - Uniban",
                        "description": "Banner expansível para o vestibular da uniban",
                        "thumb": "img/portifolio/thumbs/uniban.jpg",
                        "content": "img/portifolio/uniban.jpg"
                    }]
                },
                {
                    "title": "CD-ROM",
                    "grid": [{
                        "title": "2003 - Wido",
                        "description": "Cd-rom promocional onde foram utilizadas técnicas de sincronia de lábios, captura e edição de voz, criação de mascote p/ empresa. Os softwares utilizados foram o Sound Forge, Illustrator e o Flash.",
                        "thumb": "img/portifolio/thumbs/wido.png",
                        "content": "img/portifolio/wido.jpg"
                    }, {
                        "title": "2005 - Track & Field",
                        "description": "Cd-rom interativo feito no Macromedia Director.",
                        "thumb": "img/portifolio/thumbs/tf.png",
                        "content": "img/portifolio/tf.jpg"
                    }]
                },
                {
                    "title": "EDITORAÇÃO GRÁFICA",
                    "grid": [{
                        "title": "2003 - Manual Mochila WIDO",
                        "description": "Manual de Instruções ilustrado.",
                        "thumb": "img/portifolio/thumbs/mochila.jpg",
                        "content": "img/portifolio/mochila.jpg"
                    }, {
                        "title": "2010 - Identidade Visual Gelo Nevada",
                        "description": "Identidade Visual para a empresa Gelo Nevada.",
                        "thumb": "img/portifolio/thumbs/gelonevada.jpg",
                        "content": "img/portifolio/gelonevada.jpg"
                    }, {
                        "title": "2004 - Citibank Club",
                        "description": "Catálogo para clube de vantagens do Citibank produzido no Adobe inDesign.",
                        "thumb": "img/portifolio/thumbs/citi.jpg",
                        "content": "pdf/citi.pdf"
                    }, {
                        "title": "2005 - Chora Brasil",
                        "description": "Projeto gráfico e editorial para a revista Chora Brasil produzido no Adobe inDesign.",
                        "thumb": "img/portifolio/thumbs/chora.jpg",
                        "content": "pdf/chora.pdf"
                    }]
                },
                {
                    "title": "ANIMAÇÃO E SONORIZAÇÃO",
                    "grid": [{
                        "title": "2007 - TV Unilever",
                        "description": "Vinheta para canal de comunicação corporativa.",
                        "thumb": "img/portifolio/thumbs/tvu.jpg",
                        "content": "videos/tvu.mp4"
                    }, {
                        "title": "2008 - Mídia para a academia Reebok",
                        "description": "Vinheta para canal de comunicação interna.",
                        "thumb": "img/portifolio/thumbs/reebok.jpg",
                        "content": "videos/reebok.mp4"
                    }, {
                        "title": "2007 - Ano Novo Unilever",
                        "description": "Vinheta para e-mail marketing de final de ano feita usando a identidade visual do cliente.",
                        "thumb": "img/portifolio/thumbs/mkt_tvu.jpg",
                        "content": "videos/mkt_tvu.mp4"
                    }, {
                        "title": "2001 - Capoeira",
                        "description": "Vinheta para canal de comunicação corporativa.",
                        "thumb": "img/portifolio/thumbs/capoeira.jpg",
                        "content": "videos/capoeira.mp4"
                    }, {
                        "title": "2001 - Sonorização",
                        "description": "Trabalho Acadêmico que consiste na sonorização da animação Lunch do artista Keith Lango, onde foram usadas técnicas de captura e edição sonora, o softwares de apoio foram o Vegas e Sound Forge.",
                        "thumb": "img/portifolio/thumbs/lunch.png",
                        "content": "videos/lunch.mp4"
                    }]
                }
            ]
        }
    }
}